### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_billing_budget.this will be created
+   resource "google_billing_budget" "this" {
+       billing_account = "01ED0E-0EF6B9-F55E96"
+       display_name    = "GCP Budget Alert"
+       id              = (known after apply)
+       name            = (known after apply)

+       amount {
+           specified_amount {
+               currency_code = "JPY"
+               units         = "3000"
            }
        }

+       budget_filter {
+           credit_types           = (known after apply)
+           credit_types_treatment = "INCLUDE_ALL_CREDITS"
+           labels                 = (known after apply)
+           services               = (known after apply)
+           subaccounts            = (known after apply)
        }

+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 0.5
        }
+       threshold_rules {
+           spend_basis       = "FORECASTED_SPEND"
+           threshold_percent = 0.85
        }
+       threshold_rules {
+           spend_basis       = "CURRENT_SPEND"
+           threshold_percent = 1
        }
    }

  # google_service_account.service_account will be created
+   resource "google_service_account" "service_account" {
+       account_id   = "service-account-id"
+       disabled     = false
+       display_name = "Service Account"
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       project      = (known after apply)
+       unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>